{
  "intents": [
    {
      "tag": "customer_info",
      "patterns": [
        "Can you provide details for customer?",
        "I need information about the customer with ID",
        "What do you know about customer?",
        "Who is the main contact for customer?",
        "Do you have the email address for customer?",
        "How can I reach customer?",
        "Where can I find the phone number for customer?",
        "What's the billing information for customer?",
        "Can you tell me about the shipping address for customer?",
        "Are there any past orders for customer?",
        "Do you have any additional notes about customer?",
        "Can you give me details about the business name for customer?",
        "Who is the contact person for customer?",
        "Can you provide the email address for customer?",
        "What's the phone number for customer?",
        "Can you tell me the billing address for customer?",
        "What is the shipping address for customer?",
        "Do you have any past orders for customer?",
        "Are there any notes for customer?"
      ]
    },    
    {
      "tag": "supplier_info",
      "patterns": [
        "Can you provide details for supplier?",
        "I need information about the supplier with ID",
        "What do you know about supplier?",
        "Who is the main contact for supplier?",
        "Do you have the email address for supplier?",
        "How can I reach supplier?",
        "Where can I find the phone number for supplier?",
        "What's the address for supplier?",
        "Can you tell me about the business name for supplier?",
        "Who is the contact person for supplier?",
        "Can you provide the email address for supplier?",
        "What's the phone number for supplier?",
        "Can you give me details about the business name for supplier?",
        "Who is the contact person for supplier?",
        "Can you provide the email address for supplier?",
        "What's the phone number for supplier?",
        "Can you tell me the address for supplier?",
        "Do you have any additional notes about supplier?"
      ]
    },    
    {
      "tag": "procurement_info",
      "patterns": [
        "Can you provide details for purchase?",
        "What do you know about the purchase with ID",
        "Can you tell me about the item purchased?",
        "What's the status of the purchase?",
        "When was the purchase made?",
        "When is the delivery expected for the purchase?",
        "What was the unit price of the item?",
        "What was the total price of the purchase?",
        "How many items were purchased?",
        "Can you provide details for the order with ID",
        "Can you tell me about the item ordered?",
        "What's the status of the order?",
        "When was the order placed?",
        "When is the delivery expected for the order?",
        "What was the unit price of the ordered item?",
        "What was the total price of the order?",
        "How many items were ordered?",
        "Do you have any additional notes about the purchase?"
      ]
    },
    {
      "tag": "inventory_info",
      "patterns": [
        "Can you provide details for item?",
        "What do you know about the item with ID",
        "Can you tell me about the item named",
        "What's the category of the item?",
        "How many units of the item are in stock?",
        "What's the unit price of the item?",
        "What's the total price of the item?",
        "What's the critical level of the item?",
        "What's the status of the item?",
        "Do you have any additional notes about the item?"
      ]
    },
    {
      "tag": "product_info",
      "patterns": [
        "Can you provide details for product?",
        "What do you know about the product with ID",
        "Can you tell me about the product named",
        "What's the unit price of the product?",
        "What's the selling price of the product?",
        "How many units of the product are available?",
        "What's the markup percentage of the product?",
        "What's the margin percentage of the product?",
        "What's the critical level of the product?",
        "What's the status of the product?",
        "Do you have any additional notes about the product?"
      ]
    },    
    {
      "tag": "sale_order_info",
      "patterns": [
        "Can you provide details for sale order?",
        "What do you know about the sale order with ID",
        "Can you tell me about the sale order placed on",
        "What's the customer ID for the sale order?",
        "What's the customer name for the sale order?",
        "What's the product ID for the sale order?",
        "What's the product name for the sale order?",
        "How many units were ordered in the sale order?",
        "What's the unit price for the product in the sale order?",
        "What's the total price for the product in the sale order?",
        "What's the status of the sale order?",
        "Who processed the sale order?",
        "What's the employee ID who processed the sale order?",
        "Details for sale order ID SO123456?",
        "Breakdown of order ID SO78910 placed last week.",
        "Customer information for order ID SO111213.",
        "Product specifics requested in order SO141516.",
        "Quantity ordered under SO171819, please.",
        "Unit price for items in order SO202122?",
        "Total invoice amount for SO232425?",
        "Current fulfillment status of SO262728?",
        "Who managed the execution of SO293031?",
        "Employee responsible for dispatching SO323334?"
      ]
    },   
    {
      "tag": "refund_info",
      "patterns": [
        "Can you provide details for the refund?",
        "What do you know about the refund with ID",
        "Can you tell me about the refund issued on",
        "What's the customer ID associated with the refund?",
        "What's the customer name associated with the refund?",
        "What's the product ID associated with the refund?",
        "What's the product name associated with the refund?",
        "How many units were refunded?",
        "What's the unit price of the refunded product?",
        "What's the total amount refunded?",
        "What's the status of the refund?",
        "Who processed the refund?",
        "What's the employee ID who processed the refund?",
        "What's the reason for the refund?"
      ]
    },    
    {
      "tag": "company_monthly_sales_info",
      "patterns": [
        "Can you provide monthly sales for the year and month?",
        "What are the sales for the month of in the year?",
        "Can you tell me about the sales for the year and month?",
        "What are the company's monthly sales for the year 2020 and month September?",
        "What are the employee's monthly sales for the year and month?",
        "Could you give the sales for this month?",
        "What is the sales on the current month?",
        "Hey, could you provide me the sales on March 2024?",
        "Can you show me the sales figures for last month?",
        "I'd like to know our sales total for May 2023.",
        "Please provide the sales data for the past month.",
        "How much did we sell in April of this year?",
        "I need the sales numbers for February 2023.",
        "What were the total sales for the month of July?",
        "Can you break down the sales by month for 2023?",
        "Show me the month-on-month sales comparison for this year.",
        "What's the sales report for the first quarter's last month?",
        "Can you fetch the sales stats for the previous month?",
        "I'm looking for the monthly sales total for August 2023.",
        "How did the sales for December last year compare to this year?",
        "Please outline the sales achievements for the last six months.",
        "What does the monthly sales trend look like for the current year?",
        "Can you provide a summary of monthly sales up to this month?",
        "Show me a report of total sales in July 2023.",
        "What was the sales revenue for August 2022?",
        "How do our sales numbers for Q2 compare with Q1?",
        "Provide a breakdown of monthly sales for the last year.",
        "What are the total sales figures from January to March?",
        "Can I see the sales trend for the past three months?",
        "What's the percentage increase in sales for November?",
        "Display sales growth for each month in 2023.",
        "Summarize our sales performance for the second half of 2022.",
        "What was the highest selling month in the previous fiscal year?"
      ]
    },        
    {
      "tag": "greeting",
      "patterns": [
        "Hi",
        "Hey",
        "How are you",
        "Is anyone there?",
        "Hello",
        "Good day"
      ],
      "responses": [
        "Hey :-)",
        "Hi there, what can I do for you?",
        "Hi there, how can I help?",
        "Greetings!",
        "Nice to see you!",
        "Hey, what's up?",
        "Hello! How's your day going?",
        "Hey, good to have you here!",
        "Hi! What brings you here today?"
      ]
    },    
    {
      "tag": "goodbye",
      "patterns": ["Bye", "See you later", "Goodbye"],
      "responses": [
        "See you later",
        "Have a nice day",
        "Bye! Come back again soon."
      ]
    },
    {
      "tag": "thanks",
      "patterns": ["Thanks", "Thank you", "That's helpful", "Thank's a lot!"],
      "responses": ["Happy to help!", "Any time!", "My pleasure"]
    },
    {
      "tag": "compliment",
      "patterns": [
        "You're doing a great job!",
        "I'm impressed with your service",
        "Your website is very user-friendly",
        "Your team is very helpful"
      ],
      "responses": [
        "Thank you so much!",
        "That's very kind of you to say!",
        "We strive to provide the best service!",
        "We appreciate your positive feedback!"
      ]
    },
    {
      "tag": "complaint",
      "patterns": [
        "I'm having trouble with your website",
        "My order hasn't arrived yet",
        "I received the wrong item",
        "Your customer service is slow to respond"
      ],
      "responses": [
        "We apologize for the inconvenience. Please let us know how we can assist you.",
        "We're sorry to hear that. We'll do our best to resolve the issue promptly.",
        "Thank you for bringing this to our attention. We'll investigate and get back to you.",
        "We understand your frustration. We'll work to address the issue and improve our service."
      ]
    },
    {
      "tag": "feedback",
      "patterns": [
        "I have a suggestion",
        "I want to leave feedback",
        "How can I provide feedback?",
        "I had a great experience",
        "I had a problem with my order",
        "Can I speak to a manager?"
      ],
      "responses": [
        "We appreciate your feedback! Please feel free to share your suggestion with us.",
        "Thank you for wanting to leave feedback! You can provide your feedback through our website/contact form.",
        "Providing feedback is easy! You can do it through our website or by contacting our customer support.",
        "We're glad you had a great experience! We love hearing positive feedback from our customers.",
        "We're sorry to hear about the problem with your order. Please let us know the details so we can assist you.",
        "Certainly, you can speak to a manager. Please hold on for a moment while we connect you."
      ]
    }
  ]
}
